<?
ob_start();
session_start();
include('conn/config.php');
include('conn/function.inc.php'); 

//if($_SESSION['session_userid']!=''){ db_connect(); }else{ echo PHPgourl('index.php'); }

if($_SESSION['session_userid']!=''){ db_connect();

$sql_userLogin = "select * from user_db where user = '".$_SESSION['session_user']."'";

$result_userLogin = get_a_line($sql_userLogin);

//--------------------------------------------------
                                    
$result_userLogins = get_rsltset($sql_userLogin);
$nr_userLogins = count($result_userLogins);

//--------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------- 
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user -------------------------------------------------------------
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user -------------------------------------------------------------                                     
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user ------------------------------------------------------------- 
//---------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------- 
//echo $result_userLogin['verifly'];
//if($nr_userLogin==''){ include('login.php');  }                                
if($result_userLogin['verifly']==0){ 
    echo PHPalert("คุณไม่มีสิทธ์เข้าถึงระบบ A5375 กรุณาแจ้งผู้ดูแลระบบ"); 
    $inser_log = "insert into `log` set user_login = '".$_SESSION['session_user']."', 
                                        date_time ='".date('Y-m-d H:i:s')."', 
                                        task_url = '".$_SERVER['REQUEST_URI']." | verifly = 0', ip = '".$_SERVER['REMOTE_ADDR']."'";
    insert_data($inser_log);
    echo PHPJavaScript("window.close();"); }
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user -------------------------------------------------------------
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user -------------------------------------------------------------                                     
//-------------------------------------------- ป้องกันการ เข้ามาด้วยไม่มี ข้อมูล user ------------------------------------------------------------- 
//---------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------------------------------------------------------------------------------------------  
                                    
$box_pid1 = $_POST['boxpid'][0]; 
$box_pid2 = $_POST['boxpid'][1]; 

$box_visit1 = $_POST['boxvisit'][0]; 
$box_visit2 = $_POST['boxvisit'][1]; 
	   
$box_record1 = $_POST['boxdaterecord'][0]; 
$box_record2 = $_POST['boxdaterecord'][1]; 

$ptid_all = $_POST['ptid_all'];
///////////////////////////////////////////////////////////////////
/////////////////////////// Check PTID ////////////////////////////
///////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////
if($ptid_all=='Y'){ $sql_ptid = ""; 
}else{ 
if($box_pid1==''){ echo PHPalert('Error PTID'); echo PHPback(); }
if($box_pid2==''){ echo PHPalert('Error PTID'); echo PHPback(); }
$sql_ptid = "(ptid between '$box_pid1' and '$box_pid2')";  
}  
///////////////////////////////////////////////////////////////////
/////////////////////////// Check PTID ////////////////////////////
///////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////



$visit_all = $_POST['visit_all'];
///////////////////////////////////////////////////////////////////
/////////////////////////// Check VISIT ////////////////////////////
///////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////
if($visit_all=='Y'){ $sql_visit = ""; 
}else{ 
if($box_visit1==''){ echo PHPalert('Error Visit'); echo PHPback(); }
if($box_visit2==''){ echo PHPalert('Error Visit'); echo PHPback(); }
$sql_visit = "(visit_code between '$box_visit1' and '$box_visit2')";  }  
///////////////////////////////////////////////////////////////////
/////////////////////////// Check VISIT ////////////////////////////
///////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////

if($sql_ptid !='' ){  $sql_ptid_commend = $sql_ptid." and "; }else{ $sql_ptid_commend = $sql_ptid;}
if($sql_visit !='' ){  $sql_visit_commend = $sql_visit." and "; }else{ $sql_visit_commend = $sql_visit;}



$tbname = $_REQUEST['tbname'];
$runtime = date('d')."".date('M')."".date('Y')."".date('HH')."".date('ii')."".date('ss');
$strExcelFileName="explode_$tbname"."_".$runtime.".xls";
header("Content-Type: application/x-msexcel; name=\"$strExcelFileName\"");
header("Content-Disposition: inline; filename=\"$strExcelFileName\"");
header("Pragma:no-cache");/**/
?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Explode to Excel Super Damo</title>
</head>

<body>
<? /**/

/*print_r($_POST['cbox']);*/
$arr_cbox = $_POST['cbox'];
for($i=0;$i<=count($arr_cbox);$i++){ $line = $line +1;
	 if($arr_cbox[$i]!=''){ $alert_f .= $arr_cbox[$i]; if($line<count($arr_cbox)){ $alert_f .=","; } }
}
function to_dateformat2($date){
	$date_var = explode('/',$date);
	$short_month_name = array('Jan'=>'01','Feb'=>'02','Mar'=>'03','Apr'=>'04','May'=>'05','Jun'=>'06','Jul'=>'07','Aug'=>'08','Sep'=>'09','Oct'=>'10','Nov'=>'11','Dec'=>'12');
	foreach($short_month_name as $d=>$k){
		if(strtoupper($date_var['1'])== strtoupper($d)){
			$var_month = $k;
		}
	}
	$dateformat = $date_var['2']."-".$date_var['1']."-".$date_var['0'];//$date_var['2']."-".$var_month."-".$date_var['0'];
	return $dateformat;
}
//---------------- date all 
if($_REQUEST['date_all']=='Y'){
    $sql_date_commend = "";
}else{
    $sql_date_commend = "(date_record between '".to_dateformat2($box_record1)."' and '".to_dateformat2($box_record2)."')";
}
//---------------- date all 

// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
    
    if($sql_ptid_commend!='' || $sql_visit_commend!= '' || $sql_date_commend!='' ){
        $sql_data = "select $alert_f from $tbname where $sql_ptid_commend  $sql_visit_commend $sql_date_commend ";
    }else{
        $sql_data = "select $alert_f from $tbname order by id_record asc";
    }
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
$result_data = get_rsltset($sql_data);
$nr_data = count($result_data);
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
// ------------------------------------------ comment sql --------------------------------------------------------------
?>
<table width="100%" border="1" cellspacing="5" cellpadding="5">
  <tr>
    <? for($titleH=0;$titleH<=count($arr_cbox);$titleH++) { if($arr_cbox[$titleH]!=''){ ?><td><?=$arr_cbox[$titleH]?></td> <? } } ?>
     
  </tr>
  <? for($r=0;$r<$nr_data;$r++){ ?>
  <tr>
    <? for($titleH=0;$titleH<=count($arr_cbox);$titleH++) {  if($arr_cbox[$titleH]!=''){ ?>
    <td><?=$result_data[$r][$titleH]?></td> 
	<?   }
	} ?>
  </tr>
  <? }?>
</table>

</body>
</html>
<?php 
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
//---------------------------------- Log ----------------------------------------
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
$inser_log = "insert into `log` set user_login = '".$_SESSION['session_user']."' ,  task_url = '".$_SERVER['REQUEST_URI']."',  date_time ='".date('Y-m-d H:i:s')."', ip = '".$_SERVER['REMOTE_ADDR']."'";
insert_data($inser_log);
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
//---------------------------------- Log ----------------------------------------
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
                                   } else { include('login.php'); } ?>